{
  "AF": "A rugged meeting point of Central and South Asia, shaped by mountains and deep history. Best for travelers drawn to culture-first journeys and landscapes that feel truly off the usual track.",
  "AL": "Sea-and-mountain contrast lands fast, with an easygoing Balkan pace. Great for sunlit coasts, hill towns, and days that swing from swims to scenic drives.",
  "DZ": "Sahara scale and a Mediterranean edge give every journey a sense of distance. Go for big horizons, layered heritage, and the pull of the desert frontier.",
  "AS": "Polynesian island life sets a warm, community-first rhythm. Perfect for lush scenery, ocean time, and a slower trip that feels grounded and local.",
  "AD": "High Pyrenees air and compact villages make this feel built for a reset. Ideal for hikes, ski days, and cozy evenings with views in every direction.",
  "AO": "Atlantic coastline and wide-open interior landscapes hint at a country still under-traveled. Best for curious explorers who like big space, bold nature, and a sense of discovery.",
  "AI": "Caribbean calm and clear-water beaches keep the focus beautifully simple. Made for unhurried days, long swims, and quiet luxury without the fuss.",
  "AQ": "Icebound wilderness at the bottom of the world feels almost unreal. This is for stark beauty, polar wildlife, and the thrill of true remoteness.",
  "AG": "Two-island Caribbean ease comes with endless shoreline and sailing weather. Great for beach days, breezy evenings, and doing very little very well.",
  "AR": "Big-country drama runs from city swagger to wide-open wilderness. Best for long-distance road feelings, great meals, and landscapes that keep changing shape.",
  "AM": "Ancient roots and highland scenery give it a quietly powerful presence. Ideal for history lovers, mountain views, and a culture that rewards unhurried days.",
  "AW": "Reliable sunshine and an easygoing beach rhythm make this a no-stress escape. Perfect for warm-water swims, seaside dinners, and switching your brain off.",
  "AU": "Vast distances, iconic coastlines, and confident cities make it feel like multiple trips in one. Great for outdoor days, neighborhood wandering, and a true sense of scale.",
  "AT": "Alpine scenery and music-city polish create a classic European mix. Best for mountain air, elegant streets, and food-and-culture days that end on a high note.",
  "AZ": "Caucasus landscapes and Caspian-side city life bring sharp contrast in a small area. Go for layered history, strong flavors, and a crossroads energy you can feel.",
  "BS": "Turquoise water and easy island logistics make beach time effortless. Ideal for boat days, sandy resets, and a vacation that stays light and bright.",
  "BH": "Gulf island life pairs modern shine with deep regional roots. Great for waterfront evenings, markets and cafes, and a quick trip with plenty of character.",
  "BD": "River-delta geography shapes daily life, food, and the feel of the land. Best for travelers who love big energy, warm hospitality, and culture that runs deep.",
  "BB": "Breezy beach days come with a confident local culture and an easy social vibe. Perfect for swimming, sunsets, and a classic Caribbean holiday with substance.",
  "BY": "Forests, lakes, and broad-city avenues give it a calm, understated mood. Suited to slow travel, thoughtful museums, and a quieter side of Europe.",
  "BE": "Small distances pack in medieval streets, art cities, and serious food-and-drink culture. Great for weekend-style wandering that still feels rich and varied.",
  "BZ": "Jungle-and-sea contrast makes it easy to split days between nature and water. Best for snorkeling, wildlife time, and laid-back adventure without the rush.",
  "BJ": "West African heritage and coastal life create a trip with real texture. Go if you want history, rhythm, and everyday culture that feels close to the source.",
  "BM": "Atlantic island charm pairs pastel towns with clear-water escapes. Perfect for beach breaks with a polished feel and a slower, gentler pace.",
  "BT": "Himalayan scenery and a culture built around tradition give it rare depth. Best for mountain calm, monastery moments, and travel that feels intentional.",
  "BO": "High-altitude landscapes and Indigenous heritage make it feel strikingly different. Great for big-sky days, markets, and a trip that leans into the extraordinary.",
  "BQ": "Dry, sunlit islands and clear water keep the vibe outdoors-first. Ideal for easy beaches, snorkeling days, and a quiet Caribbean reset with room to roam.",
  "BA": "Mountains, rivers, and layered history sit close together and show up fast. Best for cafe culture, old-town wandering, and scenery that feels intimate and dramatic.",
  "BW": "Wild spaces and iconic safari country make nature the headline. Go for big skies, slow days on the land, and animals in their element.",
  "BV": "Uninhabited and fiercely remote, it is wilderness in its purest form. This is for map-lovers and the idea of the faraway more than a typical trip.",
  "BR": "Sheer size brings rainforest, coastline, and city life into one electric package. Best for bold flavor, music-and-movement energy, and days that run late.",
  "IO": "A far-flung Indian Ocean outpost feels defined by water and distance. Made for daydreaming about remote atolls, not conventional sightseeing.",
  "VG": "Sailing culture and calm coves make it feel built for the sea. Perfect for island-hopping days, snorkel stops, and sunset-to-sunset relaxation.",
  "BN": "Rainforest greens and gold-domed elegance sit side by side on Borneo. Ideal for quiet luxury, cultural curiosity, and nature that feels close.",
  "BG": "Black Sea breezes and mountain backdrops give you options in every season. Great for old cities, hearty food, and a trip that stays good value.",
  "BF": "Sahel geography and big-hearted street life give it a grounded, human feel. Best for travelers who want culture, music, and everyday energy over polish.",
  "BI": "Rolling hills and Great Lakes proximity shape a gentle, green landscape. Go for calm scenery, warm welcomes, and travel that stays simple and sincere.",
  "KH": "Ancient temples and river life anchor a country that feels timeless. Perfect for history, street food, and that golden-hour glow that lingers.",
  "CM": "Coast, rainforest, and highlands sit within reach, each with its own mood. Best for travelers who like variety, bold flavors, and a little unpredictability.",
  "CA": "Wild nature and multicultural cities make it feel spacious and easy to breathe in. Great for road trips, mountain-and-lake days, and a city break that stays outdoorsy.",
  "KY": "Clear water and reef time make this a classic Caribbean splurge spot. Ideal for diving days, beach calm, and an effortless, sunny reset.",
  "CF": "Dense forests and big-river landscapes hint at a wilder Central Africa. Suited to the truly adventurous, with travel that prioritizes nature and remoteness.",
  "TD": "Sahara-to-savanna transitions give it a raw, wide-open feel. Best for travelers drawn to big emptiness, stark beauty, and the edge of the desert.",
  "CL": "A long, narrow country that runs from desert extremes to southern wilderness. Great for epic scenery, clean air, and journeys that feel made for distance.",
  "CN": "Scale, history, and modern momentum all show up at once. Best for city-and-countryside contrast, regional cuisines, and travel that never stops surprising you.",
  "CX": "A remote island setting keeps the focus on nature and sea views. Perfect for quiet beaches, coastal walks, and a true switch-off week.",
  "CC": "Tiny atolls in a bright blue ocean deliver simple, sun-soaked escape. Best for barefoot days, lagoon swims, and doing less on purpose.",
  "CO": "Andes-to-coast variety gives it constant scenery shifts and a lively rhythm. Great for coffee-country afternoons, colorful cities, and a trip with real pulse.",
  "KM": "Indian Ocean island life feels warm, green, and deeply local. Ideal for low-key beaches, cultural curiosity, and an under-the-radar escape.",
  "CK": "Lagoon blues and Polynesian warmth make it feel instantly welcoming. Perfect for slow island days, ocean swims, and a holiday that stays uncomplicated.",
  "CR": "Rainforest biodiversity and a beach-friendly pace make nature the main event. Best for wildlife days, surf breaks, and adventure that still feels relaxed.",
  "HR": "Adriatic light, island-dotted coastlines, and stone towns do the heavy lifting. Great for swims, seafood, and evenings that stretch out.",
  "CU": "Timeworn beauty and music-in-the-air energy make it unforgettable. Go for street life, classic architecture, and a culture that feels lived-in and proud.",
  "CW": "Colorful Dutch-Caribbean streets meet easy beach days. Perfect for snorkeling, sunny terraces, and a relaxed trip with a bit of edge.",
  "CY": "Mediterranean beaches and ancient layers sit close together. Great for island drives, long lunches, and history that shows up between swims.",
  "CZ": "Storybook cities and beer-hall comfort make it an easy favorite. Best for old-town wandering, art and music nights, and cozy winter breaks.",
  "CI": "Atlantic-facing energy mixes big-city buzz with warm, everyday culture. Go for markets, music, and a trip that feels vibrant and lived-in.",
  "KP": "One of the world's most unusual destinations, defined as much by what you can't do as what you can. Best for travelers seeking rare perspective and tightly curated travel.",
  "CD": "Congo Basin forests and huge river systems give it a powerful natural presence. Suited to the truly adventurous, with nature and scale doing the talking.",
  "DK": "Design-forward cities and breezy coastlines make it feel calm and sharp at once. Great for bike-friendly days, good food, and an easy Nordic rhythm.",
  "DJ": "Surreal desert-and-sea landscapes make it feel like another planet. Best for under-the-radar adventure and a quick hit of something truly different.",
  "DM": "Green mountains and waterfalls put nature front and center. Perfect for hiking, hot springs, and a Caribbean trip that is more wild than glossy.",
  "DO": "Beach resorts are easy, but the culture is what gives it lift. Great for sun-and-sea days with music, flavor, and late-night energy nearby.",
  "EC": "Andes highlands, Amazon edges, and Pacific life create constant contrast. Best for travelers who want variety, wildlife, and culture in one compact trip.",
  "EG": "Ancient wonders and desert light make it feel larger than life. Perfect for history, Nile-side atmosphere, and cities that never quite sleep.",
  "SV": "Volcanic landscapes and surf culture make it feel small but intense. Best for beach mornings, mountain afternoons, and travel that stays straightforward.",
  "GQ": "Equatorial rainforest and island geography give it a lush, humid edge. Suited to curious travelers looking for a different corner of Central Africa.",
  "ER": "Red Sea coastline and highland cities create a distinctive, old-world mood. Best for slow wandering, architecture, and a trip that feels rare and unpolished.",
  "EE": "Medieval streets meet forests and islands in a clean, modern Baltic mix. Great for city weekends, sauna-and-sea days, and easy, walkable exploring.",
  "ET": "Highland scenery and ancient history give it a deep, distinctive identity. Best for culture-led travel, big landscapes, and a sense of place you won't confuse.",
  "FO": "Windy, ocean-framed scenery makes every view feel cinematic. Perfect for hikes, quiet villages, and the kind of trip that clears your head fast.",
  "FK": "Remote South Atlantic islands with wildlife and wide, open skies. Best for nature lovers, birdlife, and a true edge-of-the-map feeling.",
  "FM": "Island chains and lagoon life make it feel built around the ocean. Ideal for slow travel, snorkeling days, and a Pacific escape that stays quiet.",
  "FJ": "Friendly island culture and beach time come as standard. Great for warm-water days, easy adventures, and a holiday that feels genuinely welcoming.",
  "FI": "Lakes, forests, and sauna culture define a calm, restorative rhythm. Best for winter magic or summer light, with nature always close.",
  "FR": "Art cities, food culture, and wildly varied landscapes keep it endlessly re-visit-able. Great for neighborhood wandering, long meals, and day trips that feel like mini-vacations.",
  "GF": "Equatorial rainforest meets a distinctly French everyday life. Suited to travelers who want nature, space, and something genuinely different.",
  "PF": "Lagoon blues and island serenity make it the definition of a romantic reset. Perfect for ocean days, slow evenings, and scenery that does not need filters.",
  "TF": "Subantarctic wilderness and near-empty islands are the appeal. This is for extreme remoteness and the romance of faraway places, not typical tourism.",
  "GA": "Rainforest, rivers, and Atlantic coastline give it a quietly wild feel. Best for nature-forward trips where you want space and fewer crowds.",
  "GE": "Caucasus mountains and a legendary food-and-wine culture make it easy to love. Great for long table nights, scenic drives, and a feeling of old-world depth.",
  "DE": "Big cities run efficient and creative, while small towns feel storybook. Best for museums, beer gardens, and train-hopping through varied regions.",
  "GH": "Warm hospitality and coastal history give it real emotional pull. Great for markets, music, and a West African trip that feels alive and welcoming.",
  "GI": "A tiny peninsula with outsized views and a distinct mix of cultures. Perfect for a short break of sea air, strolling streets, and watching ships roll by.",
  "GR": "Island light, ancient sites, and long-lunch living are the point. Best for sea swims, village evenings, and history that sits right in the open.",
  "GL": "Arctic scale and ice-carved landscapes make it feel elemental. Go for fjords, northern light moods, and the thrill of vast, quiet space.",
  "GD": "A lush Caribbean island that feels more garden than resort strip. Perfect for beach days with green hills, local flavor, and an easy, friendly pace.",
  "GP": "French-Caribbean style meets lush interiors and beach time. Great for food, warm-water days, and island hopping with a little extra character.",
  "GU": "Pacific island energy with an easy, familiar infrastructure. Best for beach breaks, cultural curiosity, and a trip that stays simple.",
  "GT": "Volcano backdrops and Maya heritage give it instant drama. Perfect for colorful towns, market mornings, and highland adventures.",
  "GG": "Channel Island calm brings sea views and a gentle, coastal pace. Great for cliff walks, small harbors, and an easy escape close to Europe.",
  "GN": "A West African country with rugged landscapes and strong local life. Best for travelers who want culture-first days and roads that feel like an adventure.",
  "GW": "Low-key islands and a slower coastal rhythm keep it beautifully under the radar. Perfect for quiet beach time and a trip that feels unforced.",
  "GY": "Wild interior landscapes and a South American edge make it feel genuinely adventurous. Best for nature-led travel where big rivers and big skies set the tone.",
  "HT": "Art, history, and a powerful sense of identity make it memorable. Go for culture, mountain-and-coast scenery, and a trip that feels raw and real.",
  "HM": "Uninhabited subantarctic islands where the weather and wildlife make the rules. This is for true remoteness and nature at its most uncompromising.",
  "HN": "Caribbean coastlines and inland highlands give you nature in multiple moods. Best for beach days, ruins-and-rainforest energy, and a trip with real variety.",
  "HK": "Skyline drama meets green trails and harbor views in the same day. Perfect for fast-paced city breaks, incredible food, and easy escapes into nature.",
  "HU": "Grand river-city architecture and cafe culture make it feel effortlessly livable. Best for thermal baths, late dinners, and a weekend that turns into a week.",
  "IS": "Volcanic landscapes and clean, otherworldly light make every stop feel unreal. Great for waterfalls, hot springs, and a road trip that keeps one-upping itself.",
  "IN": "A continent-sized country where languages, cuisines, and landscapes change fast. Best for big cultural immersion, unforgettable food, and travel that expands you.",
  "ID": "Thousands of islands deliver beaches, volcanoes, and deep tradition in one sweep. Perfect for temple days, surf breaks, and slow mornings that turn into adventures.",
  "IR": "Persian history and generous hospitality make it feel rich and human. Best for architecture, bazaars, and a culture-first journey with real depth.",
  "IQ": "Ancient riverlands and layered history give it a profound sense of origins. Suited to travelers drawn to heritage, storytelling places, and big, serious landscapes.",
  "IE": "Green countryside and a sea-battered coast give it instant atmosphere. Perfect for pub nights, scenic drives, and a trip that feels friendly from day one.",
  "IM": "An island in the Irish Sea with rugged coasts and a proud local identity. Great for coastal walks, quiet towns, and a low-key break with fresh air built in.",
  "IL": "Desert, coastline, and sacred history sit within reach of each other. Best for city breaks with meaning, great food, and landscapes that change quickly.",
  "IT": "Beauty feels routine here, from grand cities to small hill towns. Perfect for art days, long meals, and travel that rewards simply wandering.",
  "JM": "Music, mountains, and beach life combine into a mood you can feel. Best for warm-water days, bold flavors, and nights that spill into stories.",
  "JP": "Hyper-modern cities and deep tradition balance each other with ease. Great for design, temples, neighborhoods, and food that sets the bar high.",
  "JE": "Channel Island charm brings coastal scenery and a gentle, walkable pace. Perfect for sea air, short hikes, and a tidy little escape that feels close and easy.",
  "JO": "Desert landscapes and ancient history give it instant cinematic weight. Best for Petra-level wonder, wide skies, and a trip that feels timeless.",
  "KZ": "Steppe scale meets modern city ambition and mountain edges. Great for wide-open drives, big horizons, and a sense of space you rarely get elsewhere.",
  "KE": "Safari country and Indian Ocean coastline make it a dream two-in-one. Best for wildlife mornings, beach afternoons, and travel that feels iconic for a reason.",
  "SZ": "A small kingdom with big landscapes and a strong sense of tradition. Perfect for wildlife, mountains, and a quieter Southern Africa experience.",
  "KI": "Low-lying atolls and open ocean define a truly remote Pacific life. Best for travelers who value simplicity, solitude, and endless sky.",
  "XK": "Mountain scenery and cafe culture make it feel young, lively, and welcoming. Great for affordable city breaks, hikes nearby, and a Balkan trip that still feels new.",
  "KW": "Gulf waterfront life and modern ambition shape the experience. Best for food, museums, and a city-focused trip with a distinctly local rhythm.",
  "KG": "High mountains and nomadic heritage give it pure outdoor energy. Perfect for hikes, lake days, and travel that feels rugged in the best way.",
  "LA": "Mekong River life and temple calm set a slower, softer pace. Best for laid-back cities, lush scenery, and days that unfold without pressure.",
  "LV": "Baltic coastal air meets elegant city streets and forest escapes. Great for art-and-architecture weekends with nature always within reach.",
  "LB": "Mediterranean coastline and mountain views sit improbably close together. Best for food, nightlife, and a culture-rich break with real intensity.",
  "LS": "High-altitude scenery earns it a true 'mountain kingdom' feel. Perfect for pony-track adventures, crisp air, and landscapes that stay dramatic.",
  "LR": "Atlantic coastline and a resilient history give it a quietly compelling pull. Suited to travelers who want West African culture, beaches, and a less-traveled route.",
  "LY": "Desert scale and a Mediterranean edge create a bold, sunlit atmosphere. Best for big horizons, ancient layers, and travel that feels far from ordinary.",
  "LI": "A tiny Alpine principality where mountains set the agenda. Great for scenic walks, quiet luxury, and a clean, compact escape.",
  "LT": "Baltic mood and baroque beauty make it feel both calm and cultured. Perfect for old-town evenings, forest air, and a city break with depth.",
  "LU": "Small but polished, with green valleys and easy cross-border wandering. Best for relaxed city days, countryside strolls, and a quietly classy break.",
  "MO": "A compact blend of Chinese and Portuguese influence with high-rise sparkle. Great for food-driven weekends, heritage streets, and a city break that runs late.",
  "MG": "An island apart, with landscapes and wildlife found nowhere else. Best for nature lovers who want something truly distinctive and a little wild.",
  "MW": "Warm lake life and gentle highlands give it an easy, friendly feel. Perfect for relaxed days outdoors and a trip that stays simple and sincere.",
  "MY": "A multicultural mix with rainforests, islands, and big-city shine. Great for street food, temples, and hopping between nature and nightlife.",
  "MV": "Lagoons and white-sand calm turn the volume down instantly. Best for swimming, snorkel days, and doing very little in a very beautiful place.",
  "ML": "Sahel landscapes and deep cultural history make it feel rooted and real. Suited to travelers drawn to music, heritage, and West Africa's human warmth.",
  "MT": "Sunlit stone cities and deep Mediterranean history fit into a compact trip. Perfect for swims between sightseeing, night walks, and easy island days.",
  "MH": "Far-off atolls and open ocean create a true 'end of the line' vibe. Best for lagoon time, quiet horizons, and a Pacific escape that feels rare.",
  "MQ": "French-Caribbean life brings beaches with a distinctly stylish everyday feel. Great for warm-water days, good food, and a trip that feels both relaxed and refined.",
  "MR": "Sahara dunes meet Atlantic air in a country built on vastness. Best for desert road feelings, big skies, and travel that leans into the frontier.",
  "MU": "Indian Ocean beaches come with a multicultural, easygoing island rhythm. Perfect for resort calm with good food, hikes, and a little extra polish.",
  "YT": "A French island in the Comoros region with warm water and a strong local identity. Best for lagoon days, cultural curiosity, and a quieter Indian Ocean break.",
  "MX": "Ancient history, bold flavors, and wildly varied landscapes keep it endlessly compelling. Great for beach time, city energy, and a trip built around food.",
  "MD": "Soft countryside and wine culture make it a low-key European surprise. Best for slow travel, long lunches, and a trip that feels unhurried and local.",
  "MC": "Riviera glamour comes concentrated, with sea views and sharp style everywhere. Perfect for a quick luxury hit, harbor walks, and people-watching at its finest.",
  "MN": "Big-sky steppe and nomadic heritage make it feel like freedom in landscape form. Best for wide horizons, campfire nights, and travel that resets your sense of scale.",
  "ME": "Adriatic coastline and rugged mountains sit startlingly close. Great for beach mornings, mountain afternoons, and old towns built for strolling.",
  "MS": "A small Caribbean island with a quiet, resilient spirit and dramatic scenery. Perfect for slow days, nature walks, and a break that feels genuinely low-key.",
  "MA": "Markets, mountains, and desert edges bring constant color and contrast. Best for medina wandering, bold flavors, and trips that feel sensory and alive.",
  "MZ": "Long Indian Ocean coastline makes it an easy pick for sea-first travel. Great for island hopping, warm-water swims, and beach days with fewer crowds.",
  "MM": "Golden temples and river life give it a timeless, atmospheric pull. Best for culture-focused travel, street food, and scenery that feels painterly.",
  "NA": "Desert drama and wildlife country create a trip built around space. Perfect for road trips, stargazing, and landscapes that look like another planet.",
  "NR": "One of the smallest island nations, with ocean on every side. Best for travelers who value simplicity, solitude, and a true outpost feel.",
  "NP": "Himalayan scale and spiritual heritage make it a classic for a reason. Great for trekking days, temple calm, and the kind of journey that stays with you.",
  "NL": "Canals, cycling culture, and easygoing cities make it effortlessly livable. Best for museum days, cafe hopping, and short trips that feel full.",
  "NC": "French-Pacific life meets lagoon blues and wide, open beaches. Perfect for slow island time with a touch of European ease.",
  "NZ": "Mountains, lakes, and coastlines arrive in rapid-fire succession. Best for outdoor days, road-trip freedom, and scenery that keeps raising the bar.",
  "NI": "Volcano-and-lake landscapes make it feel dramatic without trying. Great for surf towns, colonial streets, and a trip that stays relaxed and affordable.",
  "NE": "Sahara edges and Sahel life give it stark beauty and big-sky atmosphere. Best for travelers drawn to desert scale and the romance of the far horizon.",
  "NG": "Creative energy and sheer scale make it feel like a cultural powerhouse. Go for music, food, and cities that move fast and think big.",
  "NU": "A remote Pacific island with clear water and a proudly local pace. Perfect for snorkeling, cliffy coastlines, and a break that feels truly unplugged.",
  "NF": "Ocean-swept and quietly historic, it feels like a small world of its own. Best for coastal walks, slow days, and a reset that stays simple.",
  "MK": "Lake views, mountain backdrops, and Balkan warmth make it easy to settle in. Great for cafe days, scenic drives, and a culture-rich trip without the crowds.",
  "MP": "Pacific island scenery with an easy resort rhythm. Perfect for beach days, warm-water swims, and a simple tropical escape.",
  "NO": "Fjords, mountains, and clean northern light make it feel crisp and cinematic. Best for hikes, cozy cities, and winter nights that lean into the dark.",
  "OM": "Desert, mountains, and coastline combine into a country built for contrast. Great for road trips, warm hospitality, and landscapes that feel quietly epic.",
  "PK": "Towering mountain ranges and ancient routes give it huge adventure appeal. Best for trekking, big views, and culture that feels rich and layered.",
  "PW": "Clear lagoons and island life make the ocean the main attraction. Perfect for diving, boat days, and a Pacific trip that stays blissfully simple.",
  "PS": "History and everyday life sit close, with deep roots and real feeling. Best for culture-focused travel, meaningful places, and food that tells a story.",
  "PA": "Two-ocean geography and tropical nature make it feel dynamic and fresh. Great for city breaks, rainforest days, and easy escapes to the coast.",
  "PG": "Extraordinary cultural diversity and rugged landscapes make it feel truly different. Suited to adventurous travelers who want nature, tradition, and fewer crowds.",
  "PY": "A quieter side of South America, with rivers shaping the rhythm. Best for slow travel, local life, and a trip that feels unpretentious and real.",
  "PE": "Andes scale and ancient history create instant awe. Great for highland adventures, world-class food, and days that feel like a storybook.",
  "PH": "Island chains deliver beach time, warm water, and easy adventure. Perfect for hopping between coves, city breaks, and laid-back coastal living.",
  "PN": "One of the most remote inhabited places on Earth, defined by distance and sea. Best for travelers chasing true isolation and a rare kind of quiet.",
  "PL": "History runs deep, but the cities feel young and energetic. Great for old-town wandering, hearty food, and a Central Europe trip with real value.",
  "PT": "Atlantic light and easygoing cities make it feel instantly livable. Best for coastal drives, cafe culture, and food-and-wine days that stretch out.",
  "PR": "Caribbean beaches come with a strong cultural identity and city life close by. Perfect for old-town strolls, rainforest day trips, and a warm, easy reset.",
  "QA": "Modern skyline shine meets desert edges and Gulf waterfront life. Best for a short, high-comfort trip with great museums, food, and architecture.",
  "CV": "Atlantic island winds and a music-rich culture give it real soul. Great for beach hikes, ocean views, and a laid-back break that still feels alive.",
  "KR": "Fast, futuristic cities balance beautifully with mountains and tradition. Best for nightlife, design, and food culture that rewards curiosity.",
  "CG": "Rainforest greens and river life give it a quiet, equatorial mood. Suited to travelers who want nature, culture, and a less-traveled Central Africa.",
  "RO": "Carpathian landscapes and storybook towns make it feel mythic in places. Great for mountain drives, castle days, and a trip that stays good value.",
  "RU": "Vast geography and heavyweight culture make it feel like multiple worlds. Best for grand cities, long distances, and travel that favors the curious.",
  "RW": "Green hills and a strong conservation story give it a clear, modern identity. Best for wildlife experiences, scenic drives, and a trip that feels well cared for.",
  "RE": "Volcanic scenery and French island life create a dramatic, outdoorsy mix. Perfect for hikes, beaches, and a trip that feels both wild and comfortable.",
  "SH": "A remote Atlantic island where isolation is part of the charm. Best for slow days, sea views, and the romance of a faraway place.",
  "KN": "Two-island Caribbean ease with a classic, postcard look. Perfect for beach days, short hikes, and a simple, sunny reset.",
  "LC": "Mountain-meets-sea drama gives it instant wow factor. Best for beaches, rainforest air, and a romantic trip that still feels adventurous.",
  "PM": "A slice of France in the North Atlantic, with brisk air and coastal charm. Great for quiet walks, local culture, and a trip that feels pleasantly different.",
  "VC": "Volcanic islands and sailing-friendly bays make it feel built for the sea. Perfect for beach time, island hopping, and a laid-back Caribbean rhythm.",
  "BL": "Small-island glamour keeps it polished, sunny, and easy. Best for beach clubs, boutique stays, and a stylish reset in the Caribbean.",
  "MF": "An easy beach break with a lively, international feel. Perfect for sun-soaked days, great food, and a trip that stays social and simple.",
  "WS": "Polynesian culture and lush island scenery give it a strong sense of place. Best for beach days, village life, and a trip that feels warm and welcoming.",
  "SM": "A hilltop microstate with medieval streets and big views over the countryside. Great for a day-trip detour that feels like stepping into a postcard.",
  "SA": "Desert scale and deep heritage make it feel both ancient and newly open. Best for cultural travel, dramatic landscapes, and big, high-contrast journeys.",
  "SN": "Atlantic breezes and a music-rich urban energy set the tone. Great for markets, long evenings, and a West African trip that feels stylish and welcoming.",
  "RS": "River-city nights and Balkan warmth make it easy to get pulled in. Best for cafe culture, history, and a trip where evenings are half the point.",
  "SC": "Granite islands and clear lagoons deliver a high-end tropical classic. Perfect for beach days, snorkeling, and a honeymoon-level reset.",
  "SL": "A friendly coastal country with beach potential and a strong cultural heartbeat. Best for travelers who want warm welcomes and a less-traveled West Africa.",
  "SG": "A compact city-state where food, design, and efficiency shine. Perfect for a fast-paced stopover that still feels rich and rewarding.",
  "SX": "Small-island beach life with a lively, cosmopolitan buzz. Great for easy swims, waterfront dinners, and a holiday that keeps moving.",
  "SK": "Mountain landscapes and castle towns make it quietly rewarding. Best for hikes, hearty food, and a Central Europe trip that stays relaxed.",
  "SI": "Alpine scenery meets Mediterranean influence in a country that feels perfectly sized. Great for lakes, caves, and a road trip that stays easy and scenic.",
  "SB": "Remote Pacific islands with a slower rhythm and a strong connection to the sea. Best for diving, quiet beaches, and travel that feels genuinely off-grid.",
  "SO": "A long coastline and deep history sit on the Horn of Africa. Suited to travelers focused on culture and context, with a destination that demands care and planning.",
  "ZA": "Coast, mountains, wine country, and safari lands all compete for attention. Best for big variety, great food, and a trip that can be as urban or wild as you want.",
  "GS": "Subantarctic wilderness where wildlife and weather take center stage. This is for extreme remoteness and raw nature, not conventional travel.",
  "SS": "Big rivers and wide savannas shape a young country with immense landscapes. Suited to travelers seeking context-rich travel and a strong sense of place.",
  "ES": "City life, coastlines, and late-night culture make it endlessly easy to love. Great for tapas-style wandering, art days, and sun that shows up on schedule.",
  "LK": "Tea-country hills and beach life combine with deep cultural roots. Perfect for train rides, temple days, and a compact trip with big variety.",
  "SD": "Nile geography and desert horizons give it a powerful, ancient feel. Best for history-minded travelers and landscapes that read like the start of civilization.",
  "SR": "Rainforest interior and multicultural life create a trip that feels quietly unique. Great for slow travel, river scenery, and a different side of South America.",
  "SJ": "High Arctic drama and long winter light create an unforgettable atmosphere. Best for polar landscapes, wildlife, and a trip that feels genuinely extreme.",
  "SE": "Clean design and deep nature access make everyday life feel effortlessly stylish. Great for city breaks, forest air, and a calm Nordic reset.",
  "CH": "Alpine precision and postcard scenery make it feel almost too perfect. Best for hikes, lake days, and train rides that double as sightseeing.",
  "SY": "Ancient cultural layers and a profound sense of history define the place. Suited to travelers focused on heritage and understanding, with a destination shaped by recent conflict.",
  "ST": "Two small equatorial islands with lush scenery and a slow, warm rhythm. Perfect for quiet beaches, nature time, and a low-key escape that feels rare.",
  "TW": "Mountain backdrops and night-market energy make it feel both modern and soulful. Best for food, hot springs, and city days with nature close.",
  "TJ": "High mountain landscapes make it feel like pure adventure country. Best for road trips, big views, and travel that rewards effort.",
  "TZ": "Safari legends and Indian Ocean beaches make it a dream combination. Perfect for wildlife days, island time, and a trip that feels classic and unforgettable.",
  "TH": "Street food, temples, and beach escapes make it an all-time favorite. Best for island hopping, city energy, and easy, joyful travel.",
  "GM": "A river-shaped country with beach time and warm West African hospitality. Great for slow days, birdlife, and an easy introduction to the region.",
  "TL": "Rugged coastlines and under-the-radar energy make it feel like a fresh discovery. Best for travelers who want simple beach days and a real sense of new.",
  "TG": "A slender slice of West Africa with markets, coastline, and everyday culture up close. Great for travelers who want local rhythm and a trip that stays grounded.",
  "TK": "Tiny atolls and open ocean define a truly remote Pacific life. Best for simplicity, solitude, and that far-from-everything feeling.",
  "TO": "Polynesian island life with a proud culture and an easy pace. Perfect for warm-water days, lagoon time, and a holiday that feels genuinely local.",
  "TT": "Caribbean beach time comes with a strong cultural pulse and festival energy. Great for food, music, and a trip that feels vibrant beyond the shoreline.",
  "TN": "Mediterranean ease meets Saharan edges in a compact, varied trip. Best for old medinas, beach days, and desert light without long distances.",
  "TR": "A true crossroads where ancient history and modern city life overlap daily. Perfect for Istanbul-level energy, coastal breaks, and food that keeps you planning the next meal.",
  "TM": "Desert landscapes and Silk Road history give it a mysterious, little-visited appeal. Best for travelers who like unusual routes and a strong sense of place.",
  "TC": "Clear water and beach perfection keep the agenda blissfully simple. Perfect for swimming, sand, and a high-sun, low-effort reset.",
  "TV": "A tiny atoll nation where ocean and sky are the main features. Best for travelers who want simplicity, quiet, and true Pacific remoteness.",
  "UG": "Lush landscapes and some of Africa's most iconic wildlife experiences sit within reach. Best for gorilla-and-safari dreams, lake days, and warm hospitality.",
  "UA": "Big cities, deep culture, and wide landscapes give it real substance. Best for history, art, and a trip that feels meaningful and human.",
  "AE": "Skyline spectacle and desert calm make a surprisingly good pairing. Best for high-comfort city breaks, ambitious architecture, and quick escapes to the dunes.",
  "GB": "History, humor, and neighborhoods with distinct identities make it endlessly walkable. Great for museums, pub culture, and short trips that feel full of stories.",
  "US": "From national-park scale to world-class cities, the variety is the whole point. Best for road trips, big nature, and choosing your own kind of trip.",
  "UM": "Scattered ocean outposts where remoteness and wildlife are the headline. This is about the idea of faraway places more than conventional tourism.",
  "VI": "Easy Caribbean beach life with a relaxed, familiar feel. Perfect for island hopping, snorkel days, and a simple sun-and-sea break.",
  "UY": "Low-key cool with a strong cafe culture and an easy coastal pace. Best for long lunches, beach towns, and a South America trip that stays mellow.",
  "UZ": "Silk Road heritage and striking architecture make it feel like a living history book. Great for market days, city-to-city travel, and culture that runs deep.",
  "VU": "Volcanic islands and warm Pacific hospitality keep it adventurous and friendly. Perfect for hikes, beaches, and a trip that still feels like a secret.",
  "VA": "A tiny state with world-class art and a sense of history in every stone. Best for a short, unforgettable visit that feels bigger than its size.",
  "VE": "Mountain-to-coast variety and dramatic natural landscapes define the potential. Suited to travelers focused on nature and culture, with planning and context essential.",
  "VN": "Street food, mountain scenery, and buzzing cities make it wildly satisfying. Best for scooter days, coastal stops, and a trip that feels vivid and alive.",
  "WF": "Remote island life with a distinctly Polynesian feel and a slower pace. Perfect for quiet beaches, cultural curiosity, and an escape that stays simple.",
  "EH": "Desert horizons and Atlantic edges create a stark, sunlit mood. Best for travelers drawn to wide-open space and the beauty of emptiness.",
  "YE": "Ancient heritage and dramatic landscapes give it profound cultural weight. Suited to travelers focused on history and understanding, with safety and planning paramount.",
  "ZM": "River country and classic safari regions make it an easy nature pick. Perfect for waterfall days, wildlife time, and big skies that never get old.",
  "ZW": "Iconic landscapes and a strong sense of history give it real presence. Best for waterfall drama, safari days, and travel that feels classic and grounded.",
  "AX": "A Baltic archipelago mood where sea air and quiet roads set the pace. Great for cycling, coastal walks, and a low-key Nordic reset."
}

